app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---
  def index
    @groups = @current_user.groups

SELECT  "users".* FROM "users"  WHERE "users"."phone_number" = '9177637884' LIMIT 1
INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-12 02:47:17.425883"], ["name", "test JSON group"], ["updated_at", "2014-07-12 02:47:17.425883"]]
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."group_id" = 2 AND "memberships"."user_id" = 1 LIMIT 1
INSERT INTO "memberships" ("created_at", "group_id", "owner", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-12 03:39:28.280302"], ["group_id", 13], ["owner", "f"], ["updated_at", "2014-07-12 03:39:28.280302"], ["user_id", 1]]
UPDATE "memberships" SET "owner" = ?, "updated_at" = ? WHERE "memberships"."id" = 2  [["owner", "t"], ["updated_at", "2014-07-12 02:47:17.429967"]]
---
  def create
    @group = Group.new(group_params)
    if params[:user]
      params[:users].each do |number|
        @user = User.find_by phone_number: number
        @group.users << @user
      end
    end
    @group.users << @current_user

    respond_to do |format|
      if @group.save
        @membership = Membership.find_by group: @group, user: @current_user
        @membership.owner = true
        @membership.save

SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."user_id" = 2 AND "memberships"."group_id" = 11 LIMIT 1
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 10]]
---
  def destroy
    @membership = Membership.find_by user: @current_user, group: @group
    puts @membership.inspect
    respond_to do |format|
      if @membership.owner == true
        @group.destroy

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 21]]
---
    def set_group
      @group = Group.find(params[:id])