app/controllers/memberships_controller.rb

  def index
    @memberships = Membership.all
---
SELECT "memberships".* FROM "memberships"