app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @photos = Photo.all

INSERT INTO "photos" ("created_at", "location", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-09 04:27:10.716830"], ["location", ""], ["time", "2014-07-09 04:26:00.000000"], ["updated_at", "2014-07-09 04:27:10.716830"], ["user_id", 1]]
---
  def create
    @photo = Photo.new(photo_params)
    @photo.user = @current_user
    @photo.image_data = params[:image_data]

    respond_to do |format|
      if @photo.save

DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo.destroy

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_photo
      @photo = Photo.find(params[:id])