app/controllers/roll_calls_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 9]]
---
  def index
    @groups = @current_user.groups

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 22]]
---
  def show_group
    @group = Group.find(params[:group_id])

INSERT INTO "roll_calls" ("created_at", "duration", "group_id", "started", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-04 04:19:35.588696"], ["duration", 30], ["group_id", 21], ["started", "2014-08-04 04:19:35.588210"], ["updated_at", "2014-08-04 04:19:35.588696"], ["user_id", 9]]
---
  def create
    @roll_call = RollCall.new(roll_call_params)
    @roll_call.user = @current_user
    @roll_call.started = Time.now

    respond_to do |format|
      if @roll_call.save

SELECT  "roll_calls".* FROM "roll_calls"  WHERE "roll_calls"."id" = ? LIMIT 1  [["id", 21]]
---
    def set_roll_call
      @roll_call = RollCall.find(params[:id])