app/controllers/users_controller.rb

  def login
    @user = User.find_by phone_number: params[:phone_number]
    respond_to do |format|
      if params[:password] and @user and @user.password == params[:password]
        @auth_key = AuthKey.where(user: @user).first
        if @auth_key.updated_at < 10.seconds.ago
---
SELECT  "users".* FROM "users"  WHERE "users"."phone_number" = '9177637884' LIMIT 1
SELECT  "auth_keys".* FROM "auth_keys"  WHERE "auth_keys"."user_id" = 10  ORDER BY "auth_keys"."id" ASC LIMIT 1
UPDATE "auth_keys" SET "auth_key" = ?, "updated_at" = ? WHERE "auth_keys"."id" = 12  [["auth_key", "ffac4c37e56dcdca5c6463fae4805a3f"], ["updated_at", "2014-07-12 02:31:57.593720"]]

  def find_friends
    @users = params[:users]
    @friends = []
    @users.each do |u|
      if User.exists? :phone_number => u.to_int
---
SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users"  WHERE "users"."phone_number" = '19177637884' LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        format.json { render json: { :auth_key => AuthKey.where(user: @user).first, :user => @user }, status: :created }
---
INSERT INTO "users" ("created_at", "first_name", "last_name", "password", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-07-17 05:20:32.327977"], ["first_name", "admin"], ["last_name", "user"], ["password", "password"], ["phone_number", "2125551010"], ["updated_at", "2014-07-17 05:20:32.327977"]]
SELECT  "auth_keys".* FROM "auth_keys"  WHERE "auth_keys"."user_id" = 10  ORDER BY "auth_keys"."id" ASC LIMIT 1